In [1]:
#installing and using pandas

In [2]:
import pandas
pandas.__version__

'1.0.1'

In [3]:
#introducing pandas

In [4]:
import numpy as np
import pandas as pd

In [5]:
#series

In [6]:
counts=pd.Series([199,299,399])

In [7]:
counts.values

array([199, 299, 399], dtype=int64)

In [8]:
counts.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
car=pd.Series([600,700,800,900],
              index=['jeep','benz','audi','thar'])
car

jeep    600
benz    700
audi    800
thar    900
dtype: int64

In [11]:
car['audi']

800

In [13]:
car[0]

600

In [14]:
car.name='racing'
car.index.name='modern'
car

modern
jeep    600
benz    700
audi    800
thar    900
Name: racing, dtype: int64

In [15]:
np.log(car)

modern
jeep    6.396930
benz    6.551080
audi    6.684612
thar    6.802395
Name: racing, dtype: float64

In [16]:
car[car>700]

modern
audi    800
thar    900
Name: racing, dtype: int64

In [18]:
car_dict={'jeep':600   ,'audi':400,
         'thar':500}
print(car_dict)

{'jeep': 600, 'audi': 400, 'thar': 500}

In [20]:
pd.Series(car_dict)

jeep    600
audi    400
thar    500
dtype: int64

In [21]:
#dataframe

In [40]:
data={'province':["fl","fl","nh","nh","zh"],
     "year":['2000','3000','4000','5000','6000'],
     "literacy":[2,4,6,8,10]}
print(data)
data=pd.DataFrame(data)
data

{'province': ['fl', 'fl', 'nh', 'nh', 'zh'], 'year': ['2000', '3000', '4000', '5000', '6000'], 'literacy': [2, 4, 6, 8, 10]}

  province  year  literacy
0       fl  2000         2
1       fl  3000         4
2       nh  4000         6
3       nh  5000         8
4       zh  6000        10

In [30]:
#change order

In [41]:
df=pd.DataFrame(data,columns=['year',"province","literacy"])
df

   year province  literacy
0  2000       fl         2
1  3000       fl         4
2  4000       nh         6
3  5000       nh         8
4  6000       zh        10

In [45]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   year province  literacy  Serie_aligned
0  2000       fl         2              0
1  3000       fl         4              1
2  4000       nh         6              2
3  5000       nh         8              3
4  6000       zh        10              4

In [47]:
df.to_dict()

{'year': {0: '2000', 1: '3000', 2: '4000', 3: '5000', 4: '6000'},
 'province': {0: 'fl', 1: 'fl', 2: 'nh', 3: 'nh', 4: 'zh'},
 'literacy': {0: 2, 1: 4, 2: 6, 3: 8, 4: 10},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [48]:
pd.DataFrame(df.to_dict())

   year province  literacy  Serie_aligned
0  2000       fl         2              0
1  3000       fl         4              1
2  4000       nh         6              2
3  5000       nh         8              3
4  6000       zh        10              4

In [49]:
#dataframe as specialised dictionary

In [50]:
data=[{'a':i,'b':10*i}for i in range(5)]
print(data)
pd.DataFrame(data)
pd.DataFrame([{'aa':1,"bb":2},{"bb":3,"cc":6}])

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}]

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [51]:
#2d numpyarray

In [54]:
pd.DataFrame(np.random.randint(2,12),
            columns=['tor','rot'],
            index=['a','b','c'])

   tor  rot
a    8    8
b    8    8
c    8    8

In [55]:
#pandas index object

In [58]:
ind=pd.Index([2,4,5,6,7,8,6,7])
ind

Int64Index([2, 4, 5, 6, 7, 8, 6, 7], dtype='int64')

In [59]:
#index as immutable array

In [61]:
ind[1]

4

In [62]:
ind[::]

Int64Index([2, 4, 5, 6, 7, 8, 6, 7], dtype='int64')

In [63]:
ind[1]=0

TypeError: Index does not support mutable operations

In [64]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

8 (8,) 1 int64

In [65]:
#operating on datain pandas

In [69]:
jop=np.random.RandomState(15)
jos=pd.Series(jop.randint(0,10,4))
jos

0    8
1    5
2    5
3    7
dtype: int32

In [72]:
dfr=pd.DataFrame(jop.randint(0,10,(5,4)),
                columns=['a','b','c','d'])
dfr

   a  b  c  d
0  5  3  1  0
1  8  7  5  8
2  1  2  8  3
3  1  3  7  2
4  7  2  0  0

In [73]:
np.exp(jos)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
dtype: float64

In [74]:
np.sin(dfr*np.pi/4)

              a         b             c             d
0 -7.071068e-01  0.707107  7.071068e-01  0.000000e+00
1 -2.449294e-16 -0.707107 -7.071068e-01 -2.449294e-16
2  7.071068e-01  1.000000 -2.449294e-16  7.071068e-01
3  7.071068e-01  0.707107 -7.071068e-01  1.000000e+00
4 -7.071068e-01  1.000000  0.000000e+00  0.000000e+00

In [75]:
#universal functions

In [76]:
#index alignment

In [86]:
area=pd.Series({'kerala':100,'goa':200,'karanataka':300},name='area')
population=pd.Series({'kerala':10,'goa':20,'tamilnadu':50},name='population')
print(area)
population

kerala        100
goa           200
karanataka    300
Name: area, dtype: int64

kerala       10
goa          20
tamilnadu    50
Name: population, dtype: int64

In [87]:
population / area

goa           0.1
karanataka    NaN
kerala        0.1
tamilnadu     NaN
dtype: float64

In [88]:
area.index | population.index

Index(['goa', 'karanataka', 'kerala', 'tamilnadu'], dtype='object')

In [91]:
A = pd.Series([4, 8, 6], index=[0, 1, 2])
B = pd.Series([5, 7, 5], index=[1, 2, 3])
print(A)
print(B)
B
A + B

0    4
1    8
2    6
dtype: int64
1    5
2    7
3    5
dtype: int64

0     NaN
1    13.0
2    13.0
3     NaN
dtype: float64

In [92]:
A.add(B, fill_value=0)

0     4.0
1    13.0
2    13.0
3     5.0
dtype: float64

In [93]:
#mergeoperations

In [94]:
df

   year province  literacy  Serie_aligned
0  2000       fl         2              0
1  3000       fl         4              1
2  4000       nh         6              2
3  5000       nh         8              3
4  6000       zh        10              4

In [100]:
df2 = pd.DataFrame({"Province": ["fl", "nh", "zh"], "Population": ["10000", "20000", "30000"]})
df2

  Province Population
0       fl      10000
1       nh      20000
2       zh      30000

In [103]:
#combining datawith overlap

In [112]:
serie_a = pd.Series([np.nan, 3, np.nan, 4, 5, np.nan],
                     index=['g','f', 'e', 'd', 'c', 'b' ])
serie_b = pd.Series(np.arange(len(serie_a), dtype=np.float64),
                 index=['g','f', 'e', 'd', 'c', 'b'])

In [113]:
serie_a

g    NaN
f    3.0
e    NaN
d    4.0
c    5.0
b    NaN
dtype: float64

In [114]:
serie_b

g    0.0
f    1.0
e    2.0
d    3.0
c    4.0
b    5.0
dtype: float64

In [115]:
pd.Series(np.where(pd.isnull(serie_a), serie_b, serie_a), index=serie_a.index)

g    0.0
f    3.0
e    2.0
d    4.0
c    5.0
b    5.0
dtype: float64

In [116]:
serie_a.combine_first(serie_b)

g    0.0
f    3.0
e    2.0
d    4.0
c    5.0
b    5.0
dtype: float64